package day01praticetopice;

public class day01note {
    //**
    //
    //第三节 变量是什么
    //在JAVA中我们通过三个元素来描述变量：变量类型，变量名以及变量值。
    //String love="imooc";
    //变量类型 变量名 值（其中String具有不可变性，重新赋值后会生成新的String对象，love变量名这实际是指向对象地址的引用，"imooc"为具体的值）。
    //love="I love imooc"; 变量重新赋值，重新指向了一个新的对象，对象值为"i love imooc“。第三节 变量是什么
    //在JAVA中我们通过三个元素来描述变量：变量类型，变量名以及变量值。
    //String love="imooc";
    //变量类型 变量名 值（其中String具有不可变性，重新赋值后会生成新的String对象，love变量名这实际是指向对象地址的引用，"imooc"为具体的值）。
    //love="I love imooc"; 变量重新赋值，重新指向了一个新的对象，对象值为"i love imooc“。
    //
    //
    //第五节 Java中变量的使用规则
    //1、Java 中的变量需要先声明后使用
    //2、变量使用时，可以声明变量的同时进行初始化,也可以先声明后赋值
    //String love="imooc";或者String love;love="I love imooc";
    //3、变量中每次只能赋一个值，但可以修改多次
    //4、main 方法中定义的变量必须先赋值，然后才能输出
    //5、虽然语法中没有提示错误，但在实际开发中，变量名不建议使用中文，容易产生安全隐患，譬如后期跨平台操作时出现乱码等等
    //
    //
    //第八节 JAVA常量的应用
    //所谓常量可以理解成一种特殊的变量，它的值被设定后，在程序运行过程中不允许被改变。
    //final 常量名=值;
    //final double PI=3.14; final String LOVE="imooc";
    //常量名一般使用大写字符。
    //程序中使用常量可以提高代码的可维护性。例如，在项目开发时，我们需要指定用户的性别，此时可以定义一个常量 SEX，
    // 赋值为 "男"，在需要指定用户性别的地方直接调用此常量即可，避免了由于用户的不规范赋值导致程序出错的情况
    //
    //
    //
    //
    //
    //
    //
    //
    //
    //
    // /
}
